package task3;
//Дан текст (строка). Найдите наибольшее количество подряд идущих пробелов в нем.
public class Question6 {
    public static  void main(String[] args) {
        String n="";
        int i=1;
        String text="welcome to our class in epam ";
        if (text== n){
            i++;
            System.out.println(i);

        }


    }
}
