package task2;
//Дан массив действительных чисел, размерность которого N. Подсчитать, сколько в нем отрицательных,
//положительных и нулевых элементов
public class Question3 {
    public static <n> void main(String[] args) {

      //  Дан массив действительных чисел, размерность которого N. Подсчитать, сколько в нем отрицательных,
             //   положительных и нулевых элементов.
      int a[] =new int [100];
        int otr;int pol,zero;

        for (int i=1;i<=100;i++){
            if (a[i] < 0){

            System.out.println(otr);
            else  (a[i]=0){
                System.out.println(zero);
                }
            else (a[i]>){
                System.out.println(pol);
                }
            System.out.println("Negative = "+ otr+" positive = "+ pol+" equal to zero ="+ zero);
        }
        }

    }
}
