package task2;

public class Question3 {
    public static <n> void main(String[] args) {

      //  Дан массив действительных чисел, размерность которого N. Подсчитать, сколько в нем отрицательных,
             //   положительных и нулевых элементов.
      int a=100;
        int otr,pol,zero;
        int []num =new int[a];

        for (int i=1;i<=100;i++){
            if (a[i] >= 0){

            System.out.println(otr);
        }
        }

    }
}
