package task2;
//Сортировка обменами. Дана последовательность чисел n a a a     1 2 .Требуется переставить числа в
//порядке возрастания. Для этого сравниваются два соседних числа 1+i i a и a . Если 1+  i i a a , то делается
//перестановка. Так продолжается до тех пор, пока все элементы не станут расположены в порядке возрастания.
//Составить алгоритм сортировки, подсчитывая при этом количества перестановок.

public class Question30 {
    public static <n> void main(String[] args) {



            }

        }

