package task2;
//Дана последовательность действительных чисел а1 ,а2 ,..., ап. Заменить все ее члены, большие данного Z, этим
//числом. Подсчитать количество замен
import java.util.Arrays;
import java.util.Scanner;

public class Question2 {
    public static <n> void main(String[] args) {

        Scanner scanner=new Scanner(System.in);
     int max[] =new int [100];
     int k,i,n,z;
     System.out.println("Enter dimension");
     n=scanner.nextInt();

     System.out.println("'Enter z:");
     z=scanner.nextInt();
     k=0;
     System.out.println("Source");
     for (i=1;i<=n;i++){

     }

    }
}
